#include "head_1.h"
#include "head_2.h"
#include "head_3.h"
#include "head_4.h"

void main( ){ 
	if((finput=fopen("G:\\软件系统设计\\练习\\输入文件.txt","r"))==NULL){
		printf("不好意思文件打开失败！");
		exit(0);
	}

	printf("请输入您的文件名(小于10个字符,以.txt作为文件名结束标志):");
	scanf("%s",fname);
	if((foutput=fopen(fname,"w"))==NULL){
		printf("不好意思文件创建失败！");
		exit(0);
	}

	cc=-1;
	ll=0; 
/*--------------------------------------------------第二次作业--------------------------------------------------*/
	/*---word是关键字表（10个关键字）---*/
	word[0]="begin      ";
	word[1]="end        ";
	word[2]="for        ";
	word[3]="step       ";
	word[4]="until      ";
	word[5]="do         ";
	word[6]="integer    ";
	word[7]="if         ";
	word[8]="then       ";
	word[9]="else       ";
	
/*---wsym是关键字的种别编码表，有10行----*/
	wsym[0]=beginsym;
	wsym[1]=endsym;
	wsym[2]=forsym;
	wsym[3]=stepsym;
	wsym[4]=untilsym;
	wsym[5]=dosym;
	wsym[6]=integersym;
	wsym[7]=ifsym;
	wsym[8]=thensym;
	wsym[9]=elsesym;
	ch=' '; //预置空格，假定第一个读的是空格以便与getsym()函数中第一行的滤空格的动作协调
/*
	while(!feof(finput)||cc+1!=ll) //括号中的条件意为：文件没有读完或缓冲区中内容没有读完
			sym=getsym();
*/
/*--------------------------------------------------第四次作业--------------------------------------------------*/
	M[0][0]='1';M[0][1]='>';M[0][2]='>';M[0][3]='>';M[0][4]='>';M[0][5]='<';M[0][6]='>';M[0][7]='>';M[0][8]='<';M[0][9]='<';
	M[1][0]='1';M[1][1]='>';M[1][2]='>';M[1][3]='<';M[1][4]='<';M[1][5]='<';M[1][6]='>';M[1][7]='>';M[1][8]='<';M[1][9]='<';
	M[2][0]='1';M[2][1]='>';M[2][2]='>';M[2][3]='<';M[2][4]='<';M[2][5]='<';M[2][6]='>';M[2][7]='>';M[2][8]='<';M[2][9]='<';
	M[3][0]='1';M[3][1]='>';M[3][2]='>';M[3][3]='>';M[3][4]='>';M[3][5]='<';M[3][6]='>';M[3][7]='>';M[3][8]='<';M[3][9]='<';
	M[4][0]='1';M[4][1]='>';M[4][2]='>';M[4][3]='>';M[4][4]='>';M[4][5]='<';M[4][6]='>';M[4][7]='>';M[4][8]='<';M[4][9]='<';
	M[5][0]='<';M[5][1]='<';M[5][2]='<';M[5][3]='<';M[5][4]='<';M[5][5]='<';M[5][6]='=';M[5][7]='2';M[5][8]='<';M[5][9]='<';
	M[6][0]='1';M[6][1]='>';M[6][2]='>';M[6][3]='>';M[6][4]='>';M[6][5]='3';M[6][6]='>';M[6][7]='>';M[6][8]='3';M[6][9]='3';
	M[7][0]='<';M[7][1]='<';M[7][2]='<';M[7][3]='<';M[7][4]='<';M[7][5]='<';M[7][6]='4';M[7][7]='=';M[7][8]='<';M[7][9]='<';
/*--------------------------------------------------第三次作业--------------------------------------------------*/
	sym=getsym();	
	program();

	fclose(finput); 
	fclose(foutput);
}





